```
# module.aws-executor.aws_autoscaling_group.autoscaler will be created
  + resource "aws_autoscaling_group" "autoscaler" {
      + arn                       = (known after apply)
      + availability_zones        = (known after apply)
      + default_cooldown          = (known after apply)
      + desired_capacity          = (known after apply)
      + enabled_metrics           = [
          + "GroupDesiredCapacity",
          + "GroupInServiceCapacity",
          + "GroupInServiceInstances",
          + "GroupMaxSize",
          + "GroupMinSize",
          + "GroupPendingCapacity",
          + "GroupPendingInstances",
          + "GroupStandbyCapacity",
          + "GroupStandbyInstances",
          + "GroupTerminatingCapacity",
          + "GroupTerminatingInstances",
          + "GroupTotalCapacity",
          + "GroupTotalInstances",
        ]
      + force_delete              = false
      + force_delete_warm_pool    = false
      + health_check_grace_period = 300
      + health_check_type         = (known after apply)
      + id                        = (known after apply)
      + max_size                  = 1
      + metrics_granularity       = "1Minute"
      + min_size                  = 1
      + name                      = "sourcegraph_executors"
      + name_prefix               = (known after apply)
      + protect_from_scale_in     = false
      + service_linked_role_arn   = (known after apply)
      + vpc_zone_identifier       = (known after apply)
      + wait_for_capacity_timeout = "10m"

      + launch_template {
          + id      = (known after apply)
          + name    = (known after apply)
          + version = "$Latest"
        }

      + tag {
          + key                 = "deployment"
          + propagate_at_launch = true
          + value               = "sourcegraph-executors"
        }
      + tag {
          + key                 = "executor_tag"
          + propagate_at_launch = true
          + value               = "test_2"
        }
      + tag {
          + key                 = "name"
          + propagate_at_launch = true
          + value               = "sourcegraph_executors"
        }
      + tag {
          + key                 = "test_tag"
          + propagate_at_launch = true
          + value               = "some_value"
        }
    }
```

`providers.tf`

```
provider "aws" {

  default_tags {
    tags = {
      "Name"         = null
      "executor_tag" = null
      "deployment"   = "sourcegraph-executors"
      "test_tag"     = "some_value"
    }
  }
}

```